  TITLE 'HOSTCMD - Issue commands from REXX programs'
HOSTCMD  CSECT
*------------------------------------------------------------*
* This programs issues commands and subcommands in CMS for   *
* REXX programs. The REXX Address statement defines the      *
* command or subcommand environment that will receive and    *
* execute the command character string.                      *
*                                                            *
* It also implements the entry point to the EXECCOMM         *
* subcommand entry into the interpretor. Programs like       *
* EXECIO issue the EXECCOMM subcommand to set values for,    *
* retrieve values from, and drop REXX variables.             *
*------------------------------------------------------------*
         USING CMSCRAB,R13
         USING HOSTCMD,R12
         USING NUCON,0
@@HOSTCM PDPPRLG CINDEX=0,FRAME=WKAREALN,BASER=12,ENTRY=YES
         LA    R15,@@HOSTCM-HOSTCMD
         SLR   R12,R15
         USING HOSTCMD,R12
         MVI   FLAGS,0
*------------------------------------------------------------*
* Retrieve parameters. Entry R1 points to a two word parm    *
* list. The first word is the address of an LSTR structure   *
* (defined below) for the command line to be executed, and   *
* word two is the address of an LSTR structure for the name  *
* of the REXX address environment.                           *
* The LSTR structure is defined in the LSTR DSECT below.     *
*------------------------------------------------------------*
         LM     R4,R5,0(R1)       Ptr to cmd, Ptr to env name
*
*------------------------------------------------------------*
* Build a tokenized plist and an extended plist from         *
* the input command line string.                             *
*------------------------------------------------------------*
         USING  LSTR,R4           Command line
         L      R1,LSTRPSTR       Address of command line
         L      R0,LSTRLEN        Length of command line
         DROP   R4
*
         IPK    ,
         SPKA   0                 Key 0
         SSM    *+1               Disable
         L      R15,ASCANN        Build tokenied plist
         BALR   R14,R15              and extended plist
         CH    R15,=H'4'          Anything besides plist too long?
         BH    BADARG             Yes, that's bad.
         LTR   R15,R15            Was plist truncated?
         BZ    *+8                No, skip
         OI    FLAGS,TPLTRUNC     Yes, remember that.
         CLC   0(8,R1),FENCE      Empty command?
         BE    NULLCMD1           Yes, return w/ RC=0.
         CLC   0(16,R1),EXECFNC   Empty command?
         BE    NULLCMD1           Yes, return w/ RC=0
         L     R15,NUCUPPER       Standard uppercase table
         LR    R4,R1              Tokenized plist pointer
         LR    R3,R0              Tokenized plist length
*
         CH    R3,*+10            Less than or equal to max?
         BNH   *+8                OK
         LA    R3,256             Else use max
*
         BCTR  R3,0
         EX    R3,UPTRANS         Uppercase this section
*
         SPKA   0(R2)             Enable
         SSM    =X'FF'            User key
         B     SETENVNM           Go set environment name*
*
BADARG   DS    0H
         SPKA  0(R2)              Enable
         SSM   =X'FF'             User key
         B     ENVUNKN            Go back with error RC.
*
NULLCMD1 DS    0H
         SPKA  0(R2)              Enable
         SSM   =X'FF'             User key
         B     NULLCMD2
*
UPTRANS  TR    0(*-*,R4),0(R15)
*------------------------------------------------------------*
* Create an 8 byte uppercase version of the environment name *
*------------------------------------------------------------*
SETENVNM DS     0H
         USING  LSTR,R5           Environment name
         MVC    ENVNAME,=CL8'COMMAND' Assume standard env.
         MVC    ENVNAME+8(8),FENCE  CMS command fence
         L      R2,LSTRPSTR       Address of environment name
         L      R3,LSTRLEN        Length of environment name
         LTR    R3,R3             Null string is
*                                    another way to specify
*                                       address 'COMMAND'
         BZ     ENVSET
         CH     R3,=H'8'          Could it be a PSW?
         BNE    ENVNPSW           No.
         CLI    3(R2),X'00'       Is it a PSW?
         BNE    ENVNPSW           No.
         MVC    ENVNAME,0(R2)     Yes, set it,
         OI     FLAGS,ENVISPSW       remember that,
         B      ENVSET                  and don't upcase it.
ENVNPSW  DS     0H
         CH     R3,*+10           Truncate length
         BNH    *+8                 to 8 bytes
         LA     R3,8
*
         MVI    ENVNAME,C' '      Set Environment
         MVC    ENVNAME+1(8-1),ENVNAME  Name and
         OC     ENVNAME(*-*),0(R2)      uppercase
         EX     R3,*-6
ENVSET   DS     0H
         DROP   R5
*------------------------------------------------------------*
* Setup EXECCOMM subcommand environment                      *
*------------------------------------------------------------*
         MVC   SBSL(SBSLLEN),SBSP Set MF=L pattern
         SUBCOM SET,NAME='EXECCOMM',ENTRY=EXECCOMM,                    *
               UWORD=(R13),INTTYPE=ALL,KEY=NUCLEUS,                    *
               MF=(E,SBSL)
         TM    FLAGS,ENVISPSW    Is it a PSW?
         BZ    NOTPSW            No, normal SUBCOM.
*------------------------------------------------------------*
* "Non-SVC invocation" is called by LPSW of the env name.    *
* Hope that PSW was right!!!                                 *
*------------------------------------------------------------*
*
         STM   R0,R15,MYSAVE     Save against damage by callee.
         PUSH  USING
* IBM Rexx Reference says to pass PSW instead of command name:
         IPK   ,                 Save protect key.
         SPKA  0                 Get to key 0.
         MVC   CMNDLIST(8),ENVNAME  Set PSW as "command".
         SPKA  0(R2)             Back to prior key.
*        Fix EPLIST same way as for SUBCOM.
         MVC   MYEPLIST(16),NUCPLIST Copy EPLIST from ASCANN
         MVC   MYEPLIST+4(4),MYEPLIST Adjust second word of EP
         LA    R1,CMNDLIST        Set PSW in
         ST    R1,MYEPLIST           EPLIST.
*
         L     R2,GCCCRABA       Get the GCCCRAB.
         L     R2,ROOTCMSC-GCCCRAB(,R2)  Get the rootcmscrab.
         L     R2,BACK-CMSCRAB(,R2)  Go back to our save area.
         L     R2,GR2-CMSCRAB(,R2)  R2 at time of bREXX invocation.
         LA    R0,MYEPLIST       Point to cleaned-up EPLIST.
         LA    R1,CMNDLIST       Point to PLIST.
         LA    R13,SAVEAREA      Pass savearea.
         USING SAVEAREA,R13
         LA    R14,PSWRET        Return address.
         LPSW  CMNDLIST          Call subcommand.
PSWRET   DS    0H
         LM    R0,R14,MYSAVE-SAVEAREA(R13)  Restore all but R15.
         POP   USING
         B     GOBACK            Pass back the return code
*------------------------------------------------------------*
* address COMMAND is called with a call type X'01' plist     *
*------------------------------------------------------------*
NOTPSW   DS    0H
         CLC   ENVNAME,=CL8'COMMAND' Standard environment?
         BNE   CHKSUBCM           Try subcommand environments
         CLC   CMNDLIST(8),FENCE  Empty command?
         BE    NULLCMD2           Yes, return w/ RC=0.
         TM    FLAGS,TPLTRUNC     Was tokenized plist truncated?
         BO    BADARG             Yes, can't risk running it.
         LA    R1,CMNDLIST
         LA    R0,NUCPLIST        Point to contructed EPLIST
         ICM   R1,B'1000',=X'01'
         SVC   202            Run command now
         DC    AL4(1)
         B     GOBACK             Pass back the return code
*------------------------------------------------------------*
* Special command environment. Look for a subcommand         *
* processor to handle it.                                    *
*------------------------------------------------------------*
CHKSUBCM DS    0H
         MVC   SBQL(SBQLLEN),SBQP Set MF=L pattern
         SUBCOM QUERY,NAME=ENVNAME,MF=(E,SBQL)
         LTR   R15,R15
         BNZ   ENVUNKN            Unknown environment
*------------------------------------------------------------*
* For a subcommand call, R1 point to the subcommand          *
* environment name, followed by a plist fence                *
*------------------------------------------------------------*
         LA    R1,ENVNAME
*------------------------------------------------------------*
* The extended plist 1st word points to the subcommand name  *
* The 2nd word points to the beginning of the argument       *
* string. The third word points past the last argument.      *
*------------------------------------------------------------*
         MVC   MYEPLIST(16),NUCPLIST Copy EPLIST from ASCANN
         MVC   MYEPLIST+4(4),MYEPLIST Adjust second word of EP
         ST    R1,MYEPLIST          Adjust first word
         LA    R0,MYEPLIST           and extended plist
         ICM   R1,B'1000',=X'02'  Subcommand call
         SVC   202                Call the subcommand
         DC    AL4(1)
         B     GOBACK             Pass back the return code
*
NULLCMD2 DS    0H
         SR    R3,R3
         B     GOBACK
*
ENVUNKN  DS    0H
         L     R15,=F'-3'
GOBACK   DS    0H
         LR    R3,R15             Hold the command return code
         MVC   SBCL(SBCLLEN),SBCP Set MF=L pattern
         SUBCOM CLR,NAME='EXECCOMM',MF=(E,SBCL)
         LR    R15,R3             Get back the command RC
         PDPEPIL                  Return to caller
*------------------------------------------------------------*
* This entry point is called to issue a type X'05' call to   *
* an external function. R0 and R1 must be already prepared   *
* with the function call arguments. A function called by     *
* using this entry point can issue calls to EXECCOMM.        *
*------------------------------------------------------------*
@@HOST05 PDPPRLG CINDEX=0,FRAME=WKAREALN,BASER=12,ENTRY=YES
         LA    R15,@@HOST05-HOSTCMD
         SLR   R12,R15
         USING HOSTCMD,R12
*------------------------------------------------------------*
* Retrieve parameters. Pointers to the extended plist and    *
* the tokenized plist are retrieved and used for a call      *
* type X'05' invocation of an external function.             *
*------------------------------------------------------------*
         LM    R4,R5,0(R1)        Fetch entry parameters
*
*------------------------------------------------------------*
* Setup EXECCOMM subcommand environment                      *
*------------------------------------------------------------*
         MVC   SBSL(SBSLLEN),SBSP Set MF=L pattern
         SUBCOM SET,NAME='EXECCOMM',ENTRY=EXECCOMM,                    *
               UWORD=(R13),INTTYPE=ALL,KEY=NUCLEUS,                    *
               MF=(E,SBSL)
*
         LR    R0,R4              Reload entry parameters
         LR    R1,R5
         SVC   202                Call the function
         DC    AL4(1)
*
         LR    R3,R15             Hold the command return code
         MVC   SBCL(SBCLLEN),SBCP Set MF=L pattern
         SUBCOM CLR,NAME='EXECCOMM',MF=(E,SBCL)
         LR    R15,R3             Get back the command RC
         PDPEPIL                  Return to caller
*
*------------------------------------------------------------*
* This is the entry point for the EXECCOMM REXX subcommand.  *
* It is reached via an SVC 202 from a program called from    *
* a REXX EXEC. It reconnects to the GCC runtime environment  *
* of the REXX program.                                       *
*------------------------------------------------------------*
         ENTRY EXECCOMM
EXECCOMM DS    0D
         STM   R14,R12,12(R13)    Save entry regs
         LR    R12,R15
         LA    R15,EXECCOMM-HOSTCMD
         SLR   R12,R15            Establish common base
         LR    R3,R13             Hold EXECCOMM R13
         USING HOSTCMD,R12
         USING SCBLOCK,R2
         L     R13,SCBWKWRD       Load HOSTCMD R13
*
* Now R13 points to the GCC savearea in use when HOSTCOM
* called the external program with address COMMAND, or
* with an address call to a subcommand environment.
* Since we have a C runtime environment now, we can call
* any C program CSECTs in the BREXX module.
*
         LR    R5,R0              EXECCOMM EPLIST Word 4
         CLC   4(4,R5),8(R5)      BEGARGS must equal ENDARGS
         L     R15,=F'-1'
         BNE   RXERRXIT           Error exit if not
*
         L     R5,12(,R5)         Fetch a pointer to a chain
         USING SHVBLOCK,R5           chain of SHVBLOCKS
*------------------------------------------------------------*
*                                                            *
* Main loop for processing SHVBLOCKs starts here             *
*                                                            *
*------------------------------------------------------------*
MAINLOOP DS    0H                 Process next SHVBLOCK
         L     R1,GCCCRABA    Get the GCCCRAB.
         USING GCCCRAB,R1
         L     R1,PGLOBAL     Get the bREXX context.
         USING BRXCTX,R1
         CLC   CTXDEBUG,=F'1' Debug = true?
         BNE   MAINNDBG       No, skip message.
         DROP  R1
         L     R4,SHVNAMA     Name addr/
         L     R6,SHVNAML        len.
         LINEDIT TEXT='EXECCOMM: code=..(X''..'') name="...............*
               ..............."',                                      *
               SUB=(CHARA,(SHVCODE,1),HEXA,SHVCODE-3,                  *
               CHARA,((R4),(R6))),                                     *
               DOT=NO,MF=(E,LINEDPL)
MAINNDBG DS    0H
*------------------------------------------------------------*
* We only implement the "direct" interface, and then only    *
* part of it: the Store, Fetch, and Drop functions.  We will *
* implement the "symbolic" interface and the NextVariable    *
* PrivateInformation functions later if the need arises.     *
*------------------------------------------------------------*
         CLI   SHVCODE,SHVSTORE   Is it?
         BE    EXCSET
         CLI   SHVCODE,SHVFETCH   Is it?
         BE    EXCFETCH
         CLI   SHVCODE,SHVDROPV   Is it?
         BE    EXCDROPV
*
         MVI   SHVRET,SHVBADF     Bad function code
         B     RXERET             Tell the caller bad function
*------------------------------------------------------------*
* Processing for SHVSTORE                                    *
*------------------------------------------------------------*
EXCSET   DS    0H
         L     R1,GCCCRABA    Get the GCCCRAB.
         USING GCCCRAB,R1
         L     R1,PGLOBAL     Get the bREXX context.
         USING BRXCTX,R1
         CLC   CTXDEBUG,=F'1' Debug = true?
         BNE   SETNDBG        No, skip message.
         DROP  R1
         L     R4,SHVNAMA     Name addr
         L     R6,SHVNAML        and len.
         L     R7,SHVVALA     Value addr
         L     R8,SHVVALL        and len.
         LINEDIT TEXT='EXECCOMM: code=..(X''..'') name="...............*
               ..............." value=".............................."'*
               ,                                                       *
               SUB=(CHARA,(SHVCODE,1),HEXA,SHVCODE-3,                  *
               CHARA,((R4),(R6)),CHARA,((R7),(R8))),                   *
               DOT=NO,MF=(E,LINEDPL)
SETNDBG  DS    0H
         LA    R0,1               Set call
         ST    R0,RXECALLT        Set call type
         LA    R15,SHVVALL        Set address of the
         ST    R15,RXEBUFFL          variable length
         B     EXCSETUP           Go finish plist setup
*------------------------------------------------------------*
* Processing for SHVFETCH                                    *
*------------------------------------------------------------*
EXCFETCH DS    0H
         SR    R0,R0              Fetch call
         ST    R0,RXECALLT        Set call type
         MVC   SHVVALL,SHVBUFL    Set buffer length as
*                                    value length
         LA    R15,SHVVALL        Set address of the
         ST    R15,RXEBUFFL          buffer length
         B     EXCSETUP           Go finish plist setup
*------------------------------------------------------------*
* Processing for SHVDROPV                                    *
*------------------------------------------------------------*
EXCDROPV DS    0H
         LA    R0,2               Drop call
         ST    R0,RXECALLT        Set call type
         B     EXCSETUP           Go finish plist setup
*------------------------------------------------------------*
* Processing common to SHVFETCH and SHVSTORE                 *
*------------------------------------------------------------*
EXCSETUP DS    0H
         MVI   SHVRET,0
         L     R15,SHVNAML        Length of the variable name
         C     R15,=F'255'
         BNH   NAMEOK             Bif name is not too long
         MVI   SHVRET,SHVBADN
         B     RXERET             Return to EXECCOMM caller
*
NAMEOK   DS    0H
         L     R14,SHVNAMA        Address of the name
         LA    R0,VARNAME
         LA    R1,1(,R15)         Output 1 longer than input
         MVCL  R0,R14             Copy name and append a null
         L     R15,SHVNAML        Length of name
         BCTR  R15,0                -1 for execute
         L     R14,NUCUPPER
         B     *+10
         TR    VARNAME(*-*),0(R14) Uppercase the var name
         EX    R15,*-6            Now we have a C string
*------------------------------------------------------------*
* Call "RXE" to implement the data transfers specified in    *
* the SHVBLOCK structure passed as an argument to EXECCOMM.  *
*------------------------------------------------------------*
         LA    R0,VARNAME
         ST    R0,RXENAME         Set variable name Lstr ptr
*
         MVC   RXEBUFFA,SHVVALA   Set caller buffer address
*------------------------------------------------------------*
* Call RXEXCM in RXEXCOMM C for processing                   *
*------------------------------------------------------------*
         LA    R1,RXEPLIST        Plist address
         L     R15,=V(RXEXCM)     Call RXEXCOMM C
         BALR  R14,R15              to perform operation
         LTR   R15,R15            OK?
         BZ    RXERET             Done if so
*
         C     R15,=F'4'          Truncated?
         BNE   NOTRUNC            No, skip
         OI    SHVRET,SHVTRUNC    Tell the caller
         B     RXERET             Done
NOTRUNC  DS    0H
*
         C     R15,=F'2'          REXX name not found
         BNE   NOBADNM            No, skip
         CLI   SHVCODE,SHVSTORE   Is it?
         BE    RXERET             We created the variable
         OI    SHVRET,SHVBADN     Tell the caller
         B     RXERET             Done
NOBADNM  DS    0H
         LA    R15,100            Unknown error
*------------------------------------------------------------*
* Now restore the EXECCOMM runtime and return to the caller  *
* of EXECCOMM.                                               *
*------------------------------------------------------------*
RXERET   DS     0H
         CLI   SHVCODE,SHVFETCH  Is it a FETCH?
         BE    RXERDBG        Yes, display the result.
         CLI   SHVCODE,SHVSYFET  Is it a FETCH?
         BNE   RXERNDBG       No, no display.
RXERDBG  DS    0H
         L     R1,GCCCRABA    Get the GCCCRAB.
         USING GCCCRAB,R1
         L     R1,PGLOBAL     Get the bREXX context.
         USING BRXCTX,R1
         CLC   CTXDEBUG,=F'1' Debug = true?
         BNE   RXERNDBG       No, skip message.
         DROP  R1
         L     R4,SHVNAMA     Name addr
         L     R6,SHVNAML        and len.
         L     R7,SHVVALA     Value addr
         L     R8,SHVVALL        and len.
         LINEDIT TEXT='EXECCOMM: code=..(X''..'') name="...............*
               ..............." value=".............................."'*
               ,                                                       *
               SUB=(CHARA,(SHVCODE,1),HEXA,SHVCODE-3,                  *
               CHARA,((R4),(R6)),CHARA,((R7),(R8))),                   *
               DOT=NO,MF=(E,LINEDPL)
RXERNDBG DS    0H
         SR     R15,R15           Set the return code
         IC     R15,SHVRET
         LTR    R15,R15           Success with this SHVNLOK?
         BNZ    RXERRXIT          Sadly, no. Return to caller
         ICM    R5,B'1111',SHVNEXT More SHVBLOCKs to process?
         BNZ    MAINLOOP          If so go do that
RXERRXIT DS     0H                Enter here with rc in R15
         LR     R13,R3            Back to EXECCOMM R13
         L      R14,12(,R13)
         LM     R0,R12,20(R13)
         BR     R14
  TITLE 'HOSTCMD: Constants and literals'
*------------------------------------------------------------*
         DS     0D
EXECFNC  DC     CL8'EXEC',8X'FF'
FENCE    EQU    EXECFNC+8,8
SBQP     SUBCOM QUERY,NAME='EXECCOMM',MF=L
SBSP     SUBCOM SET,NAME='EXECCOMM',ENTRY=EXECCOMM,MF=L
SBCP     SUBCOM CLR,NAME='EXECCOMM',MF=L
         LTORG ,
  TITLE 'HOSTCMD: Savearea and variables'
*
* The LSTR data structure is used throughout BREXX to define
* BREXX variables.
*
LSTR     DSECT
LSTRPSTR DS    A                  Pointer to data
LSTRLEN  DS    F                  Current length of the data
LSTRLMAX DS    F                  Max data bytes allocated
LSTRTYPE DS    H                  Data type
LSTRING  EQU   0                     Character string data
LINTEGER EQU   1                     Integer fata
LREAL    EQU   2                     Floating point data
LSTRSIZE EQU   *-LSTR
*
* This is the HOSTCMD dynamic storage area addressed by R13
*
         CMSCRAB
         ORG   MAINSTK
SUBCOML  SUBCOM QUERY,NAME='ENV',MF=L
SUBCOMLL EQU   *-SUBCOML
SBQL     SUBCOM QUERY,NAME='EXECCOMM',MF=L
SBQLLEN  EQU   *-SBQL
SBSL     SUBCOM SET,NAME='EXECCOMM',ENTRY=EXECCOMM,MF=L
SBSLLEN  EQU   *-SBSL
SBCL     SUBCOM CLR,NAME='EXECCOMM',MF=L
SBCLLEN  EQU   *-SBCL
*
         DS    0D                 Align for use as a PSW
ENVNAME  DS    CL8                Environment name
         DS    8X'FF'             FENCE
*
FLAGS    DS    X                  Flags
ENVISPSW EQU   X'80'              - The environment "name" is a PSW.
TPLTRUNC EQU   X'40'              - Tokenized plist was truncated.
MYEPLIST DS    0D
         DS    6A                 Extended plist
*
RXEPLIST DS    0A
RXECALLT DS    F                  0 = fetch value
*                                 1 = set value
*                                 2 = drop variable
RXENAME  DS    A                  Ptr to VARNAME string
RXEBUFFA DS    A                  Ptr to user buffer
*                                   copied from SHVVALA
RXEBUFFL DS    A                  Address of SHVVALL. A FETCH
*                                 operation copies the calue
*                                 from SHVBUFL to SHVVALL
*                                 before calling RXEXCM
*
*  DO NOT re-order the next two save areas!
SAVEAREA DS    18F                Savearea for LPSW subcommand calls.
MYSAVE   DS    16F                Savearea around LPSW calls.
*  DO NOT re-order the above two save areas!
*
LINEDPL  LINEDIT MF=L,MAXSUBS=4
VARNAME  DS    CL256              Uppercased variable name
*                                 Assumes variable name
*                                    length <= 255
WKAREALN EQU   *-CMSCRAB
         BRXCTX ,
         GCCCRAB ,
         SVCSAVE ,
         REGEQU ,
         SCBLOCK ,
         SHVBLOCK ,
         NUCON ,
         END   ,
