/* BITOR() */
say 'Testing BITOR ...'
fail_count=0
parse source system .
select
    when system = 'CMS' then charset = 'E'
    when system = 'UNIX' then charset = 'A'
    when system = 'WIN64' then charset = 'A'
    otherwise say 'test 9 and 10 undefined'
end
/* These from TRL2. */
if bitor('15'x,'24'x) \= '35'x then call test_failed '1'
if bitor('15'x,'2456'x) \= '3556'x then call test_failed '2'
if bitor('15'x,'2456'x,'F0'x) \= '35F6'x then call test_failed '3'
if bitor('1111'x,,'4D'x) \= '5D5d'x then call test_failed '4'
/* These from Mark Hessling. */
if bitor( '123456'x, '3456'x ) \== '367656'x then call test_failed '5'
if bitor( '3456'x, '123456'x, '99'x ) \== '3676df'x then call test_failed '6'
if bitor( '123456'x,, '55'x) \== '577557'x then call test_failed '7'
if bitor( 'foobar' ) \== 'foobar' then call test_failed '8'
if charset = 'A' & bitor( 'FooBar' ,, '20'x) \== 'foobar' then call test_failed '9'
if charset = 'E' & bitor( 'foobar' ,, '40'x) \== 'FOOBAR' then call test_failed '10'
say '... BITOR done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
