/* C2D */
say 'Testing C2D ...'
fail_count=0
parse source system .
select
    when system = 'CMS' then charset = 'E'
    when system = 'UNIX' then charset = 'A'
    when system = 'WIN64' then charset = 'A'
    otherwise say 'charset undefined'
end
/* These from TRL2. */
if c2d('09'x) \== 9 then call test_failed '1'
if c2d('81'x) \== 129 then call test_failed '2'
if charset = 'E' & c2d('a') \== 129 then call test_failed '3'
if charset = 'A' & c2d('a') \== 97 then call test_failed '3'
if c2d('FF81'x) \== 65409 then call test_failed '4'
if c2d('') \== 0 then call test_failed '5'
if c2d('81'x,1) \== -127 then call test_failed '6'
if c2d('81'x,2) \== 129 then call test_failed '7'
if c2d('FF81'x,2) \== -127 then call test_failed '8'
if c2d('FF81'x,1) \== -127 then call test_failed '9'
if c2d('FF7F'x,1) \== 127 then call test_failed '10'
if c2d('F081'x,2) \== -3967 then call test_failed '11'
if c2d('F081'x,1) \== -127 then call test_failed '12'
if c2d('0031'x,0) \== 0 then call test_failed '13'
/* These from Mark Hessling. */
if c2d( 'ff80'x, 1) \== '-128' then call test_failed '14'
if charset = 'A' & c2d( 'foo' ) \== '6713199' then call test_failed '15'
if charset = 'E' & c2d( 'foo' ) \== '8820374' then call test_failed '15'
if charset = 'A' & c2d( 'bar' ) \== '6447474' then call test_failed '16'
if charset = 'E' & c2d( 'bar' ) \== '8552857' then call test_failed '16'
if c2d( '' ) \== '0' then call test_failed '17'
if c2d( '101'x ) \== '257' then call test_failed '18'
if c2d( 'ff'x ) \== '255' then call test_failed '19'
if c2d( 'ffff'x) \== '65535' then call test_failed '20'
if c2d( 'ffff'x, 2) \== '-1' then call test_failed '21'
if c2d( 'ffff'x, 1) \== '-1' then call test_failed '22'
if c2d( 'fffe'x, 2) \== '-2' then call test_failed '23'
if c2d( 'fffe'x, 1) \== '-2' then call test_failed '24'
if c2d( 'ffff'x, 3) \== '65535' then call test_failed '25'
if c2d( 'ff7f'x, 1) \== '127' then call test_failed '26'
if c2d( 'ff7f'x, 2) \== '-129' then call test_failed '27'
if c2d( 'ff7f'x, 3) \== '65407' then call test_failed '28'
if c2d( 'ff80'x, 1) \== '-128' then call test_failed '29'
if c2d( 'ff80'x, 2) \== '-128' then call test_failed '30'
if c2d( 'ff80'x, 3) \== '65408' then call test_failed '31'
if c2d( 'ff81'x, 1) \== '-127' then call test_failed '32'
if c2d( 'ff81'x, 2) \== '-127' then call test_failed '33'
if c2d( 'ff81'x, 3) \== '65409' then call test_failed '34'
if c2d( 'ffffffffff'x, 5) \== '-1' then call test_failed '35'
say '... C2D done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
