/* C2X */
say 'Testing C2X ...'
fail_count=0
parse source system .
select
    when system = 'CMS' then charset = 'E'
    when system = 'UNIX' then charset = 'A'
    when system = 'WIN64' then charset = 'A'
    otherwise say 'charset undefined'
end
/* These from TRL2. */
if charset = 'E' & c2x('72s') \== 'F7F2A2' then call test_failed '1'
if charset = 'A' & c2x('72s') \== '373273' then call test_failed '1'
if c2x('0123'x) \== '0123' then call test_failed '2'
/* These from Mark Hessling. */
if charset = 'E' & c2x( 'foobar') \== '869696828199' then call test_failed '3'
if c2x( '' )\== '' then call test_failed '4'
if c2x( '101'x )\== '0101' then call test_failed '5'
if c2x( '0123456789abcdef'x )\== '0123456789ABCDEF' then call test_failed '6'
if c2x( 'ffff'x )\== 'FFFF' then call test_failed '7'
if c2x( 'ffffffff'x )\== 'FFFFFFFF' then call test_failed '8'
say '... C2X done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
