/* CALL_ EXEC */
say 'Look for CALL OK'

if tc1() \== 1 then say 'test #1 failed'
if tc2() \== 1 then say 'test #2 failed'
if tc3() \== 1 then say 'test #3 failed'
if tc4() \== 1 then say 'test #4 failed'
signal tc5

/* Issue 90 */
signal on syntax name tc5b
call nolbl
say 'test #5A failed'
signal tc5c
tc5b:
if rc \== 43 then say 'test #5B failed.  RC =' rc
tc5c:
signal on syntax name tc5d
call nosuchlabel
say 'test #5C failed'
signal tc5d
tc5d:
if rc \== 43 then say 'test #5D failed.  RC =' rc
tc5d:
signal off syntax

/* argument check */
tc1: ;
call tc1a 'a', 'B', c, 1, 2.3
return result
tc1a: ;
if arg(1) \== 'a' then return 0
if arg(2) \== 'B' then return 0
if arg(3) \== 'C' then return 0
if arg(4) \== '1' then return 0
if arg(5) \== '2.3' then return 0
return 1

/* call sets sigl */
/* Do not move this test around - it knows its line numbers! */
tc2: ;
call tc2a
return (result == 42)
tc2a: procedure expose sigl
return sigl

/* call sets sigl deep calls */
/* Do not move this test around - it knows its line numbers! */
tc3: ;
call tc3a
return (result \== 0)
tc3a: procedure expose sigl
if sigl \== 50 then return 0
call tc3b
if result \== 0 then return result
return (sigl == 50)
tc3b: procedure expose sigl
return (sigl == 54)

/* call passing sigl as arg */
/* Do not move this test around - it knows its line numbers! */
tc4: ;
call tc4a
return result
tc4a: procedure expose sigl
call tc4b sigl
return result
tc4b: procedure
return (arg(1) == 63)

/* bREXX Issue 105 */
tc5:
call tc5a
if result \==1 then say 'test #5 failed'
signal tc5e
tc5a:
parse source . calltype .
return calltype == 'SUBROUTINE'
tc5e:
if tc6a() \==1 then say 'test #6 failed'
signal tc6e
tc6a:
parse source . calltype .
return calltype == 'FUNCTION'
tc6e:

say 'CALL OK'
exit
