/* CHAROUT */
say 'Testing CHAROUT ...'
fail_count=0
parse source system .
if system='CMS' then do
    file='test FILE A'
    address command 'ERASE' file
    eol=''
end
else if system='UNIX' then do
    file='test.file'
    'rm' file '2>/dev/null'
    eol='0D'x
end
else if system='WIN64' then do
    file='test.file'
    'del' file '2>NUL:'
    eol='0D0A'x
end
linelen=length('Line 1') + length(eol)
if system='CMS' then call charout file 'F' linelen, 'Line 1'eol
else call charout file, 'Line 1'eol
call charout file, 'Line 2'eol
call charout file, 'Line 3'eol
call charout file, 'Line 4'eol
call charout file, 'Line 5'eol
call lineout file
linecount=lines(file)
if linecount\==1 & linecount\==5 then call test_failed '1'
if linein(file)\=='Line 1' then      call test_failed '2'
if linein(file)\=='Line 2' then      call test_failed '3'
if linein(file)\=='Line 3' then      call test_failed '4'
if linein(file)\=='Line 4' then      call test_failed '5'
if linein(file)\=='Line 5' then      call test_failed '6'
if linein(file)\==''       then      call test_failed '7'
call charout file, 'Done 3', (linelen * 2) + 1
call lineout file
linecount=lines(file)
if linecount\==1 & linecount\==5 then call test_failed '8'
if linein(file)\=='Line 1' then      call test_failed '9'
if linein(file)\=='Line 2' then      call test_failed '10'
if linein(file)\=='Done 3' then      call test_failed '11'
if linein(file)\=='Line 4' then      call test_failed '12'
if linein(file)\=='Line 5' then      call test_failed '13'
if linein(file)\==''       then      call test_failed '14'
if system='CMS' then 'erase' file
else if system='UNIX' then 'rm' file
else if system='WIN64' then 'del' file
say '... CHAROUT done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
