 TITLE 'CMSEXCM test program for EXECCOMM'
CMSEXCM  CSECT
         USING NUCON,0
         STM   R14,R12,12(R13)
         LR    R12,R15
         USING CMSEXCM,R12        Set addressability
         LR    R2,R0              Incoming extended plist
         LR    R3,R1              Incoming tokenized plist
*
         LA    R0,(WORKSIZE+8)/8
         DMSFREE DWORDS=(0),TYPE=USER Allocate Work area
         LR    R6,R1              Hold WORKAREA address
         LR    R0,R6
         LA    R1,WORKSIZE
         SR    R5,R5
         MVCL  R0,R4              Zero out the WORKAREA
*
         ST    R13,4(,R6)         Chain
         ST    R6,8(,R13)            to
         LR    R13,R6                  new
         USING WORKAREA,R13              savearea
*
* Save the rest of the command line string.
*
         LM    R4,R5,4(R2)        Load begargs,endargs
         SR    R5,R4
         ST    R5,EPLENGTH        Save length of command args
         LTR   R5,R5
         BZ    EPLSET
*
         LA    R6,EPLLOCAL        Assume short EPLIST
         C     R5,=A(80-1)        Unless too long
         BNH   EPLCOPY            Save copy in our DSA
         L     R5,=A(80-1)        Use max
EPLCOPY  DS    0H
         ST    R6,EPLADDR
*
         MVI   0(R6),C' '         Blank out the area
         MVC   1(*-*,R6),0(R6)     for size of EPLIST
         EX    R5,*-6                plus one blank
*
         BCTR  R5,0               Length - 1
         MVC   0(*-*,R6),0(R4)
         EX    R5,*-6             Copy in arguments
EPLSET   DS    0H
         MVC   EPLNXT,EPLADDR     Set start of EPLIST
         MVC   EPLLEFT,EPLENGTH   Set remaining bytes to scan
*                                 EPLTOKEN has next parm
*
* Retrieve a command of DROP, FETCH, or SET
*
         LA    R4,=CL8'COMMAND'
         BAL   R14,NXTTOKEN       Get the next token
         B     MISSING            Bif operand is missing
*
         MVC   COMMAND,EPLTOKEN   Remember command verb
         CLC   =C'DROP',EPLTOKEN
         BE    VERBOK
         CLC   =C'FETCH',EPLTOKEN
         BE    VERBOK
         CLC   =C'SET',EPLTOKEN
         BNE   VERBERR            Nither FETCH or SET found
VERBOK   DS    0H
*
* Retrieve a variable name token
*
         LA    R4,=CL8'VARIABLE'
         BAL   R14,NXTTOKEN       Get the next token
         B     MISSING            Bif operand is missing
*
         MVC   VARNAME,EPLTOKEN
         LA    R4,VARNAME+7
FINDEND  DS    0H
         CLI   0(R4),C' '         Look for
         BNE   FOUNDIT              non-blank
         BCT   R4,FINDEND
FOUNDIT  DS    0H
         LA    R3,VARNAME
         SR    R4,R3              Found
         LA    R4,1(,R4)            length
         ST    R4,VARNAMEL
*
         CLC   =C'DROP',COMMAND
         BE    DROP               Parsing complete for drop
         CLC   =C'FETCH',COMMAND
         BE    FETCH              Parsing complete for fetch
*
* Retrieve rest of command line as variable contents
*
         LM    R0,R1,EPLLEFT EPLNXT EPLIST Scan ptrs
         LTR   R0,R0              Anything after Variable name
         BZ    NOOPTV             Missing value
         LA    R1,1(,R1)          If there it has to be
         BCTR  R0,0                  a blank which we skip
         LTR   R0,R0              Anything after the blank?
         BZ    NOOPTV             Missing value
*
         ST    R1,STRINGBF        Set buffer addr
         ST    R0,STRINGBL        Set length
*
*
         B     SET                Do the variable assign
*
*  Return to caller
*
EXIT0    DS    0H
         SR    R15,R15
EXITRC   DS    0H
         LR    R1,R13
         L     R13,4(,R13)
         ST    R15,16(,R13)       Pass back the return code
         LA    R0,(WORKSIZE+8)/8
         DMSFRET DWORDS=(0),LOC=(1)
         LM    R14,R12,12(R13)
         BR    R14
*------------------------------------------------------------*
*                                                            *
* Unset the variable in the calling EXEC                     *
*                                                            *
*------------------------------------------------------------*
DROP     DS    0H
         USING SHVBLOCK,R5
         LA    R1,VARNAME         REXX variable name address
         L     R0,VARNAMEL        REXX variable name length
         LA    R5,SHVAREA
         XC    SHVBLOCK(SHVBLEN),SHVBLOCK
         XC    SHEPLIST(16),SHEPLIST
*
         MVI   SHVCODE,SHVDROPV   Unset variable
         ST    R1,SHVNAMA         Set VAR name address
         ST    R0,SHVNAML                  and length
         LA    R2,BUFFER
*
         LA    R1,EXECCOMM        Fill in
         ST    R1,SHEPLIST           EPLIST
         ST    R5,SHEPL4          Word 4 -> SHVBLOCK
         LA    R0,SHEPLIST
         ICM   R1,B'1000',=X'02'
         SVC   202
         DC    AL4(1)
         B     EXITRC
         DROP  R5
*------------------------------------------------------------*
*                                                            *
* Retrieve incoming information from the calling EXEC        *
*                                                            *
*------------------------------------------------------------*
FETCH    DS    0H
         USING SHVBLOCK,R5
*
* Retrieve input from a REXX variable
*
*
         LA    R1,VARNAME         REXX variable name address
         L     R0,VARNAMEL        REXX variable name length
         LA    R5,SHVAREA
         XC    SHVBLOCK(SHVBLEN),SHVBLOCK
         XC    SHEPLIST(16),SHEPLIST
*
         MVI   SHVCODE,SHVFETCH   Fetch variable value
         ST    R1,SHVNAMA         Set VAR name address
         ST    R0,SHVNAML                  and length
         LA    R2,BUFFER
*
         ST    R2,SHVVALA         Address of value buffer
         LA    R2,L'BUFFER
         ST    R2,SHVBUFL         Length of the buffer
*
         LA    R1,EXECCOMM        Fill in
         ST    R1,SHEPLIST           EPLIST
         ST    R5,SHEPL4          Word 4 -> SHVBLOCK
         LA    R0,SHEPLIST
         ICM   R1,B'1000',=X'02'
         SVC   202
         DC    AL4(1)
*
*              R1                 REXX variable value address
*              R0                 REXX variable value length
*                                 Return  R15 = return code
         LTR   R15,R15
         BNZ   EXITRC
*
         L     R4,SHVVALA         REXX variable value address
         L     R5,SHVVALL         REXX variable value length
*
         MVC   LINEDITL(LINEDISZ),LINEDITP Set pattern
         MVI   LINEDITB,255         Set buffer size in byte 1
         LINEDIT TEXT='Value: .........................................*
               ......................................',                *
               BUFFA=LINEDITB,DISP=TYPE,                               *
               SUB=(CHARA,((R4),(R5))),                                *
               MF=(E,LINEDITL)
         SR    R15,R15
         B     EXITRC
         DROP  R5
*------------------------------------------------------------*
*                                                            *
* Send data to an EXEC caller                                *
*                                                            *
*------------------------------------------------------------*
SET      DS    0H
         USING SHVBLOCK,R5
*
* Send output to a REXX variable
*
*
         L     R3,STRINGBF        Set buffer addr
         L     R2,STRINGBL        Set length
         L     R0,VARNAMEL        REXX variable name length
         LA    R1,VARNAME         REXX variable name address
*
         LA    R5,SHVAREA
         XC    SHVBLOCK(SHVBLEN),SHVBLOCK
         XC    SHEPLIST(16),SHEPLIST
*
         MVI   SHVCODE,SHVSTORE   Call to set variable value
         ST    R1,SHVNAMA         Set VAR name address
         ST    R0,SHVNAML                  and length
         ST    R3,SHVVALA         Set VAR value address
         ST    R2,SHVVALL                  and length
*
         LA    R1,EXECCOMM        Fill in
         ST    R1,SHEPLIST           EPLIST
         ST    R5,SHEPL4          Word 4 -> SHVBLOCK
         LA    R0,SHEPLIST
         ICM   R1,B'1000',=X'02'
         SVC   202
         DC    AL4(1)
         B     EXITRC
*------------------------------------------------------------*
*                                                            *
*        Next Token Scan                                     *
*                                                            *
*------------------------------------------------------------*
NXTTOKEN DS    0H
         MVI   EPLTOKEN,C' '      Preblank target area
         MVC   EPLTOKEN+1(L'EPLTOKEN-1),EPLTOKEN
         LM    R0,R1,EPLLEFT EPLNXT Fetch EPLIST Scan ptrs
         LTR   R0,R0
         BZR   R14                Tell caller end of arguments
NXTTOK2  DS    0H
         CLI   0(R1),C' '         Found next non-blank?
         BNE   NXTTOK3            Bif so to scan token
         LA    R1,1(,R1)          To next character
         BCT   R0,NXTTOK2         Keep looking
         BR    R14                Tell caller end of arguments
NXTTOK3  DS    0H
         LR    R15,R1             Remember start of token
NXTTOK4  DS    0H
         CLI   0(R1),C' '         Found next non-blank?
         BE    NXTTOK5            Bif so to scan token
         LA    R1,1(,R1)          To next character
         BCT   R0,NXTTOK4         Keep looking
NXTTOK5  DS    0H
         STM   R0,R1,EPLLEFT EPLNXT Reset EPLIST Scan ptrs
         SR    R1,R15             Length of the token
         BCTR  R1,0
         MVC   EPLTOKEN(*-*),0(R15)
         EX    R1,*-6             Copy to 8 byte token area
         B     4(,R14)            Return argument tp caller
 TITLE 'Error exits'
*------------------------------------------------------------*
*                                                            *
* Error Exit routines                                        *
*                                                            *
*------------------------------------------------------------*
VERBERR  DS    0H
         MVC   LINEDITL(LINEDISZ),LINEDITP Set pattern
         MVI   LINEDITB,255       Set buffer size in byte 1
         LINEDIT TEXT='First token must be FETCH or SET',              *
               BUFFA=LINEDITB,DISP=TYPE,                               *
               MF=(E,LINEDITL)
         LA    R15,16
         B     EXITRC
MISSING  DS    0H
         MVC   LINEDITL(LINEDISZ),LINEDITP Set pattern
         MVI   LINEDITB,255       Set buffer size in byte 1
         LINEDIT TEXT='Missing ........ operand',                      *
               BUFFA=LINEDITB,DISP=TYPE,                               *
               SUB=(CHARA,((R4),8)),                                   *
               MF=(E,LINEDITL)
         LA    R15,16
         B     EXITRC
NOOPTV   DS    0H
         MVC   LINEDITL(LINEDISZ),LINEDITP Set pattern
         MVI   LINEDITB,255       Set buffer size in byte 1
         LINEDIT TEXT='No data to FETCH or SET',                       *
               BUFFA=LINEDITB,DISP=TYPE,                               *
               MF=(E,LINEDITL)
         LA    R15,16
         B     EXITRC
 TITLE 'Constants'
*
LINEDITP LINEDIT MF=L,MAXSUBS=5
LINEDISZ EQU   *-LINEDITP
*
*------------------------------------------------------------*
*  Constants and Literals                                    *
*------------------------------------------------------------*
         DS    0D
EXECCOMM DC    CL8'EXECCOMM'
         DC    XL8'FFFFFFFFFFFFFFFF'
*
MAXWORD  DC    A(X'7FFFFFFF')     Maximum positive integer
*
         LTORG ,
 TITLE 'Shared Variable Communications Block'
         SHVBLOCK ,
*
 TITLE 'Work Area Definitions'
*------------------------------------------------------------*
*  Program Work Areas                                        *
*------------------------------------------------------------*
WORKAREA DSECT
         DS    18A
COMMAND  DS    CL8                Program command name
VARNAME  DS    CL8                Program variable name
VARLEN   DS    FL8                Program variable name length
*
DWORD    DS    D                  Doubleword work area
*
STRINGBF DS    A                  Buffer for STRING value
STRINGBL DS    F                  Length of string buffer
*
CPBUFF   DS    A                  CP command response buffer
CPBUFFL  DS    F                  CP command buffer size
CPRESPNX DS    A                  CP response next line addr
CPRESPRL DS    F                  CP response remaining length
*
FILTERA  DS    A                  Ptr to AVOID/FIND/LOCATE
FILTERL  DS    F                    filter and length of it
*
MARGIN1  DS    F                  Selection column range
MARGIN2  DS    F
*
ZONE1    DS    F                  Search zone start column
ZONE2    DS    F                  Search zone end column
*
VARNAMEA DS    A                  Address of VAR or STEM name
VARNAMEL DS    F                  Length of the name
*
EPLENGTH DS    F                  Length of EPLIST args
EPLADDR  DS    A                  Address of large EPLIST
EPLLEFT  DS    F                  Bytes left to scan in EPLIST
EPLNXT   DS    A                  Address of next byte to scan
EPLTOKEN DS    CL8                Last token scaned from EPLIST
EPLLOCAL DS    CL(2*80)           EPLIST saved uppercase copy
*                                 +EPLENGTH is lowercase copy
*
CVBSAVE  DS    8A                 Hold R14-R5 in CVB
REXSAVE  DS    8A                 Hold R14-R5 in GETREXXV
*                                            and PUTREXXV
SAVEAREA DS    15A                Save area for R14-R12
*
PLISTBLD DS    0D                 Various plists built here
         DS    5D
LINEDITL LINEDIT MF=L,MAXSUBS=5
LINEDITB DS    CL133              LINEDIT BUFFER
*
SHEPLIST DS    A                  EPLIST for EXECCOMM call
         DS    A
         DS    A
SHEPL4   DS    A
*
SHVAREA  DS    ((SHVBLEN+7)/8)D   SHVBLOCK build area
*
         DS    0D
BUFFER   DS    CL256
WORKSIZE EQU   *-WORKAREA
         REGEQU ,
         AFT ,
         NUCON ,
         END
