/* CONDITION() */
say 'Testing CONDITION ...'
fail_count=0
parse source system .
if system = 'CMS' then suffix = ''
else suffix = '.exec'

/* condition without signal */
if condition('C') \== '' then call test_failed '1'
if condition('D') \== '' then call test_failed '2'
if condition('I') \== '' then call test_failed '3'
if condition('S') \== '' then call test_failed '4'
if condition() \== condition('I') then call test_failed '5'

/* novalue signaled */
signal on novalue name t6a
t6v
call test_failed '6'
signal t6z
t6a:
if condition('C') \== 'NOVALUE' then call test_failed '6'
if condition('D') \== 'T6V' then call test_failed '7'
if condition('I') \== 'SIGNAL' then call test_failed '8'
if condition('S') \== 'OFF' then call test_failed '9'
if condition() \== condition('I') then call test_failed '10'
t6z:
signal off novalue

/* syntax signaled */
signal on syntax name t11a
t11v = t11b()
call test_failed '11'
signal t11z
t11a:
if condition('C') \== 'SYNTAX' then call test_failed '12'
if system='CMS' & condition('D') \== 'Line 31 *-* t11v = t11b()' then call test_failed '13'
/* Need test 13 for UNIX and WIN64 here. */
if condition('I') \== 'SIGNAL' then call test_failed '14'
if condition('S') \== 'OFF' then call test_failed '15'
if condition() \== condition('I') then call test_failed '16'
t11z:
signal off syntax

/* error signaled */
signal on error name t17a
'exitpos_' || suffix
call test_failed '17'
signal t17z
t17a:
if condition('C') \== 'ERROR' then call test_failed '18'
if Translate(condition('D')) \== Translate('exitpos_' || suffix) then call test_failed '19'
if condition('I') \== 'SIGNAL' then call test_failed '20'
if condition('S') \== 'OFF' then call test_failed '21'
if condition() \== condition('I') then call test_failed '22'
t17z:
signal off error

/* failure signaled */
t=trace('o') /* Prevent trace of cmd */
signal on failure name t23a
'exitneg_' || suffix
call test_failed '23'
signal t23z
t23a:
if condition('C') \== 'FAILURE' then call test_failed '24'
if Translate(condition('D')) \== Translate('exitneg_' || suffix) then call test_failed '25'
if condition('I') \== 'SIGNAL' then call test_failed '26'
if condition('S') \== 'OFF' then call test_failed '27'
if condition() \== condition('I') then call test_failed '28'
t23z:
signal off failure
call trace t

/* error called */
if system='CMS' then do
    say 'skipped tests 29-34 due to bREXX bug #93'
    /* See https://github.com/adesutherland/CMS-370-BREXX/issues/93. */
    signal t29z
end
call on error name t29a
t29v = 0
'exitpos_' || suffix
if t29v = 0 then call test_failed '29'
signal t29z
t29a:
t29v = 1
if condition('C') \== 'ERROR' then call test_failed '30'
if Translate(condition('D')) \== Translate('exitpos_' || suffix) then call test_failed '31'
if condition('I') \== 'CALL' then call test_failed '32'
if condition('S') \== 'DELAY' then call test_failed '33'
if condition() \== condition('I') then call test_failed '34'
return
t29z:
signal off error

/* failure called */
t=trace('o') /* Prevent trace of cmd */
if system='CMS' then do
    say 'skipped tests 35-40 due to bREXX bug #93'
    /* See https://github.com/adesutherland/CMS-370-BREXX/issues/93. */
    signal t35z
end
call on failure name t35a
t35v = 0
'exitneg_' || suffix
if t35v = 0 then call test_failed '35'
signal t35z
t35a:
t35v = 1
if condition('C') \== 'FAILURE' then call test_failed '36'
if Translate(condition('D')) \== Translate('exitneg_' || suffix) then call test_failed '37'
if condition('I') \== 'CALL' then call test_failed '38'
if condition('S') \== 'DELAY' then call test_failed '39'
if condition() \== condition('I') then call test_failed '40'
return
t35z:
signal off failure
call trace t

say '... CONDITION done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
