/* DATATYPE */
say 'Testing DATATYPE ...'
fail_count=0
parse source system .
parse upper version name .
is_brexx=(Left(name, 5)='BREXX' | Left(name, 10)='REXX-BREXX')
is_zvm=Left(name, 7)='REXX370'
/* These from TRL2. */
if datatype(' 12 ') \== 'NUM' then call test_failed '1'
if datatype('') \== 'CHAR' then call test_failed '2'
if datatype('123*') \== 'CHAR' then call test_failed '3'
if datatype('12.3','N') \= 1 then call test_failed '4'
if datatype('12.3','W') \= 0 then call test_failed '5'
if datatype('Fred','M') \= 1 then call test_failed '6'
if datatype('','M') \= 0 then call test_failed '7'
if datatype('Minx','L') \= 0 then call test_failed '8'
/* This one depends on which characters are 'extra letters' */
if datatype('3d?','s') \= 1 then call test_failed '9'
if datatype('BCd3','X') \= 1 then call test_failed '10'
if datatype('BC d3','X') \= 1 then call test_failed '11'
/* These from Mark Hessling. */
if datatype('foobar') \== 'CHAR' then call test_failed '12'
if datatype('foo bar') \== 'CHAR' then call test_failed '13'
if datatype('123.456.789') \== 'CHAR' then call test_failed '14'
if datatype('123.456') \== 'NUM' then call test_failed '15'
if datatype('') \== 'CHAR' then call test_failed '16'
if datatype('DeadBeef' , 'A') \== '1' then call test_failed '17'
if datatype('Dead Beef','A') \== '0' then call test_failed '18'
if datatype('1234ABCD','A') \== '1' then call test_failed '19'
if datatype('','A') \== '0' then call test_failed '20'
if datatype('foobar','B') \== '0' then call test_failed '21'
if datatype('01001101','B') \== '1' then call test_failed '22'
if \is_zvm & datatype('0110 1101','B') \== '1' then call test_failed '23'
if \is_zvm & datatype('','B') \== '1' then call test_failed '24'
if datatype('foobar','L') \== '1' then call test_failed '25'
if datatype('FooBar','L') \== '0' then call test_failed '26'
if datatype('foo bar','L') \== '0' then call test_failed '27'
if datatype('','L') \== '0' then call test_failed '28'
if datatype('foobar','M') \== '1' then call test_failed '29'
if datatype('FooBar','M') \== '1' then call test_failed '30'
if datatype('foo bar','M') \== '0' then call test_failed '31'
if datatype('FOOBAR','M') \== '1' then call test_failed '32'
if datatype('','M') \== '0' then call test_failed '33'
if datatype('foo bar','N') \== '0' then call test_failed '34'
if datatype('1324.1234','N') \== '1' then call test_failed '35'
if datatype('123.456.789','N') \== '0' then call test_failed '36'
if datatype('','N') \== '0' then call test_failed '37'
if datatype('foo bar','S') \== '0' then call test_failed '38'
if datatype('??@##_Foo$Bar!!!','S') \== '1' then call test_failed '39'
if datatype('','S') \== '0' then call test_failed '40'
if datatype('foo bar','U') \== '0' then call test_failed '41'
if datatype('Foo Bar','U') \== '0' then call test_failed '42'
if datatype('FOOBAR','U') \== '1' then call test_failed '43'
if datatype('','U') \== '0' then call test_failed '44'
if datatype('Foobar','W') \== '0' then call test_failed '45'
if datatype('123','W') \== '1' then call test_failed '46'
if datatype('12.3','W') \== '0' then call test_failed '47'
if datatype('','W') \== '0' then call test_failed '48'
if datatype('123.123','W') \== '0' then call test_failed '49'
if datatype('123.123E3','W') \== '1' then call test_failed '50'
if datatype('123.0000003','W') \== '1' then call test_failed '51'
if datatype('123.0000004','W') \== '1' then call test_failed '52'
if datatype('123.0000005','W') \== '0' then call test_failed '53'
if datatype('123.0000006','W') \== '0' then call test_failed '54'
if datatype(' 23','W') \== '1' then call test_failed '55'
if datatype(' 23 ','W') \== '1' then call test_failed '56'
if datatype('23 ','W') \== '1' then call test_failed '57'
if datatype('123.00','W') \== '1' then call test_failed '58'
if datatype('123000E-2','W') \== '1' then call test_failed '59'
if datatype('123000E+2','W') \== '1' then call test_failed '60'
if datatype('Foobar','X') \== '0' then call test_failed '61'
if datatype('DeadBeef','X') \== '1' then call test_failed '62'
if datatype('A B C','X') \== '0' then call test_failed '63'
if datatype('A BC DF','X') \== '1' then call test_failed '64'
if datatype('123ABC','X') \== '1' then call test_failed '65'
if datatype('123AHC','X') \== '0' then call test_failed '66'
if datatype('','X') \== '1' then call test_failed '67'
if datatype('0.000E-2','w') \== '1' then call test_failed '68'
if datatype('0.000E-1','w') \== '1' then call test_failed '69'
if datatype('0.000E0','w') \== '1' then call test_failed '70'
if datatype('0.000E1','w') \== '1' then call test_failed '71'
if datatype('0.000E2','w') \== '1' then call test_failed '72'
if datatype('0.000E3','w') \== '1' then call test_failed '73'
if datatype('0.000E4','w') \== '1' then call test_failed '74'
if datatype('0.000E5','w') \== '1' then call test_failed '75'
if datatype('0.000E6','w') \== '1' then call test_failed '76'
if datatype('0E-1','w') \== '1' then call test_failed '77'
if datatype('0E0','w') \== '1' then call test_failed '78'
if datatype('0E1','w') \== '1' then call test_failed '79'
if datatype('0E2','w') \== '1' then call test_failed '80'
/* These from doc/implemen.html */
if is_brexx then if datatype('z', 'T') \== 'STRING' then call test_failed '81'
if is_brexx then if datatype(2+0.1, 'T') \== 'REAL' then call test_failed '82'
if is_brexx then if datatype(2+0, 'T') \== 'INTEGER' then call test_failed '83'
say '... DATATYPE done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
