/* LINEOUT */
say 'Testing LINEOUT ...'
fail_count=0
parse version version .
is_regina=left(version, 11) == 'REXX-Regina'
if is_regina then options NoLineOutTrunc
parse source system .
if system='CMS' then do
    file='test FILE A'
    address command 'ERASE' file
end
else if system='UNIX' then do
    file='test.file'
    'rm' file '2>/dev/null'
end
else if system='WIN64' then do
    file='test.file'
    'del' file '2>NUL:'
end
/* test that lines written correctly. */
call lineout file, 'Line 1'
call lineout file, 'Line 2'
call lineout file, 'Line 3'
call lineout file, 'Line 4'
call lineout file, 'Line 5'
call lineout file
linecount=lines(file)
if linecount\==1 & linecount\==5 then call test_failed '1'
if linein(file)\=='Line 1' then       call test_failed '2'
if linein(file)\=='Line 2' then       call test_failed '3'
if linein(file)\=='Line 3' then       call test_failed '4'
if linein(file)\=='Line 4' then       call test_failed '5'
if linein(file)\=='Line 5' then       call test_failed '6'
if linein(file)\=='' then             call test_failed '7'
/* test that a line can be replaced correctly. */
call lineout file
call lineout file, 'Done 3', 3
call lineout file
linecount=lines(file)
if linecount\==1 & linecount\==5 then call test_failed '8'
if linein(file)\=='Line 1' then       call test_failed '9'
if linein(file)\=='Line 2' then       call test_failed '10'
if linein(file)\=='Done 3' then       call test_failed '11'
if linein(file)\=='Line 4' then       call test_failed '12'
if linein(file)\=='Line 5' then       call test_failed '13'
if linein(file)\=='' then             call test_failed '14'
call lineout file
/* test that a closed file can be deleted and rewritten correctly. */
if system='CMS' then 'ERASE' file
else if system='UNIX' then 'rm' file
else if system='WIN64' then 'del' file
if system='CMS' then call lineout file 'F' 6+1, 'Line 1'
else call lineout file, 'Line 1'
call lineout file, 'Line 2'
call lineout file, 'Line 3'
call lineout file, 'Line 4'
call lineout file, 'Line 5'
call lineout file
linecount=lines(file)
if linecount\==1 & linecount\==5 then call test_failed '15'
if linein(file)\=='Line 1' then       call test_failed '16'
if linein(file)\=='Line 2' then       call test_failed '17'
if linein(file)\=='Line 3' then       call test_failed '18'
if linein(file)\=='Line 4' then       call test_failed '19'
if linein(file)\=='Line 5' then       call test_failed '20'
if linein(file)\=='' then             call test_failed '21'
call lineout file
/* test that a line can be written, overwriting the next, correctly. */
if system='CMS' then call lineout file, 'Done 3 Long 4', 3
else call lineout file, 'Done 3 Long', 3
call lineout file
linecount=lines(file)
if linecount\==1 & linecount\==5 then call test_failed '22'
if linein(file)\=='Line 1' then       call test_failed '23'
if linein(file)\=='Line 2' then       call test_failed '24'
line=linein(file)
if system='CMS' then do
    if line\=='Done 3' then           call test_failed '25'
end
else if line\=='Done 3 Long' then     call test_failed '25'
line=linein(file)
if system='CMS' then do
    if line\=='Long 4' then           call test_failed '26'
end
else if line\=='4' then               call test_failed '26'
if linein(file)\=='Line 5' then       call test_failed '27'
if linein(file)\=='' then             call test_failed '28'
if system='CMS' then 'ERASE' file
else if system='UNIX' then 'rm' file
else if system='WIN64' then 'del' file
say '... LINEOUT done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
