/* LINES */
say 'Testing LINES ...'
fail_count=0
parse source system .
if system='CMS' then do
    file='test FILE A'
    address command 'ERASE' file
end
else if system='UNIX' then do
    file='test.file'
    'rm' file '2>/dev/null'
end
else if system='WIN64' then do
    file='test.file'
    'del' file '2>NUL:'
end
call lineout file, 'Line 1'
call lineout file, 'Line 2'
call lineout file, 'Line 3'
call lineout file, 'Line 4'
call lineout file, 'Line 5'
call lineout file
linecount=lines(file)
if linecount\==1 & linecount\==5 then call test_failed '1'
Call linein file
linecount=lines(file)
if linecount\==1 & linecount\==4 then call test_failed '2'
Call linein file
linecount=lines(file)
if linecount\==1 & linecount\==3 then call test_failed '3'
Call linein file
linecount=lines(file)
if linecount\==1 & linecount\==2 then call test_failed '4'
Call linein file
if lines(file)\==1 then               call test_failed '5'
Call linein file
if lines(file)\==0 then               call test_failed '6'
signal on notready name t7z
Call linein file
call test_failed '7'
t7z:
signal off notready
if lines(file)\==0 then               call test_failed '8'
call lineout file
if system='CMS' then 'erase' file
else if system='UNIX' then 'rm' file
else if system='WIN64' then 'del' file
say '... LINES done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
