/* rexx tests */
parse arg interpreter
if interpreter='' then interpreter='rexx'
parse source source 1 system .
parse version rexx_version
say 'Rexx version' rexx_version 'on' system
say 'Rexx version' rexx_version 'on' system
suffix = '.exec'
if system='CMS' then
do
    suffix = ''
    interpreter = ''
    'CP SPOOL CONS * START'
end
fail_count=0
interpreter ' abbrev_'||suffix     ; fail_count=fail_count+rc
interpreter ' abs_'||suffix        ; fail_count=fail_count+rc
interpreter ' address_'||suffix    ; fail_count=fail_count+rc
interpreter ' add_test'||suffix    ; fail_count=fail_count+rc
interpreter ' arg_'||suffix        ; fail_count=fail_count+rc
interpreter ' arithtst'||suffix    ; fail_count=fail_count+rc
interpreter ' bitand_'||suffix     ; fail_count=fail_count+rc
interpreter ' bitor_'||suffix      ; fail_count=fail_count+rc
interpreter ' bitxor_'||suffix     ; fail_count=fail_count+rc
interpreter ' b2x_'||suffix        ; fail_count=fail_count+rc
interpreter ' call_'||suffix       ; fail_count=fail_count+rc
interpreter ' center_'||suffix     ; fail_count=fail_count+rc
interpreter ' changes_'||suffix    ; fail_count=fail_count+rc
interpreter ' charin_'||suffix     ; fail_count=fail_count+rc
interpreter ' charout_'||suffix    ; fail_count=fail_count+rc
interpreter ' chars_'||suffix      ; fail_count=fail_count+rc
interpreter ' cmsepl_'||suffix 'BREXX' ; fail_count=fail_count+rc
interpreter ' cmsexcm_'||suffix    ; fail_count=fail_count+rc
interpreter ' cmssyn_'||suffix     ; fail_count=fail_count+rc
interpreter ' compare_'||suffix    ; fail_count=fail_count+rc
interpreter ' conditi_'||suffix    ; fail_count=fail_count+rc
interpreter ' copies_'||suffix     ; fail_count=fail_count+rc
interpreter ' countst_'||suffix    ; fail_count=fail_count+rc
interpreter ' c2d_'||suffix        ; fail_count=fail_count+rc
interpreter ' c2x_'||suffix        ; fail_count=fail_count+rc
interpreter ' datatyp_'||suffix    ; fail_count=fail_count+rc
interpreter ' date_'||suffix       ; fail_count=fail_count+rc
interpreter ' delstr_'||suffix     ; fail_count=fail_count+rc
interpreter ' delword_'||suffix    ; fail_count=fail_count+rc
interpreter ' digits_'||suffix     ; fail_count=fail_count+rc
interpreter ' d2c_'||suffix        ; fail_count=fail_count+rc
interpreter ' d2x_'||suffix        ; fail_count=fail_count+rc
           /* errorms_ isn't a test, just displays message texts */
interpreter ' errorte_'||suffix    ; fail_count=fail_count+rc
interpreter ' expose_'||suffix     ; fail_count=fail_count+rc
interpreter ' expr_'||suffix       ; fail_count=fail_count+rc
           /* factria_ is an external function for testfac_ */
interpreter ' form_'||suffix       ; fail_count=fail_count+rc
interpreter ' format_'||suffix     ; fail_count=fail_count+rc
interpreter ' fuzz_'||suffix       ; fail_count=fail_count+rc
interpreter ' insert_'||suffix     ; fail_count=fail_count+rc
interpreter ' interpr_'||suffix    ; fail_count=fail_count+rc
interpreter ' lastpos_'||suffix    ; fail_count=fail_count+rc
interpreter ' left_'||suffix       ; fail_count=fail_count+rc
interpreter ' length_'||suffix     ; fail_count=fail_count+rc
interpreter ' linein_'||suffix     ; fail_count=fail_count+rc
interpreter ' lineout_'||suffix    ; fail_count=fail_count+rc
interpreter ' lines_'||suffix      ; fail_count=fail_count+rc
interpreter ' maths_'||suffix      ; fail_count=fail_count+rc
interpreter ' max_'||suffix        ; fail_count=fail_count+rc
interpreter ' min_'||suffix        ; fail_count=fail_count+rc
interpreter ' numeric_'||suffix    ; fail_count=fail_count+rc
interpreter ' options_'||suffix    ; fail_count=fail_count+rc
interpreter ' overlay_'||suffix    ; fail_count=fail_count+rc
interpreter ' parse_'||suffix      ; fail_count=fail_count+rc
interpreter ' pos_'||suffix        ; fail_count=fail_count+rc
interpreter ' qualify_'||suffix    ; fail_count=fail_count+rc
interpreter ' queued_'||suffix     ; fail_count=fail_count+rc
interpreter ' random_'||suffix     ; fail_count=fail_count+rc
interpreter ' regress_'||suffix    ; fail_count=fail_count+rc
interpreter ' reverse_'||suffix    ; fail_count=fail_count+rc
interpreter ' rexxtest'||suffix 'a bb ccc dd e' ; fail_count=fail_count+rc
interpreter ' right_'||suffix      ; fail_count=fail_count+rc
interpreter ' sign_'||suffix       ; fail_count=fail_count+rc
interpreter ' signal_'||suffix     ; fail_count=fail_count+rc
interpreter ' sourcel_'||suffix    ; fail_count=fail_count+rc
interpreter ' space_'||suffix      ; fail_count=fail_count+rc
interpreter ' stream_'||suffix     ; fail_count=fail_count+rc
interpreter ' strip_'||suffix      ; fail_count=fail_count+rc
interpreter ' substr_'||suffix     ; fail_count=fail_count+rc
interpreter ' subword_'||suffix    ; fail_count=fail_count+rc
interpreter ' symbol_'||suffix     ; fail_count=fail_count+rc
           /* testdat_ needs DATE() conversions */
interpreter ' testfac_'||suffix    ; fail_count=fail_count+rc
interpreter ' time_'||suffix       ; fail_count=fail_count+rc
interpreter ' trace_'||suffix      ; fail_count=fail_count+rc
interpreter ' transla_'||suffix    ; fail_count=fail_count+rc
interpreter ' trunc_'||suffix      ; fail_count=fail_count+rc
interpreter ' t_mult'||suffix      ; fail_count=fail_count+rc
interpreter ' value_'||suffix      ; fail_count=fail_count+rc
interpreter ' verify_'||suffix     ; fail_count=fail_count+rc
interpreter ' word_'||suffix       ; fail_count=fail_count+rc
interpreter ' wordind_'||suffix    ; fail_count=fail_count+rc
interpreter ' wordlen_'||suffix    ; fail_count=fail_count+rc
interpreter ' wordpos_'||suffix    ; fail_count=fail_count+rc
interpreter ' words_'||suffix      ; fail_count=fail_count+rc
interpreter ' xrange_'||suffix     ; fail_count=fail_count+rc
interpreter ' x2b_'||suffix        ; fail_count=fail_count+rc
interpreter ' x2c_'||suffix        ; fail_count=fail_count+rc
interpreter ' x2d_'||suffix        ; fail_count=fail_count+rc
say 'failed' fail_count 'tests'
if system='CMS' then 'CP SPOOL CONS STOP CLOSE'
exit fail_count
