/* SYMBOL */
say 'Testing SYMBOL ...'
fail_count=0
/* These from TRL2. */
drop A.3; j=3
if symbol('J') \== 'VAR' then call test_failed '1'
if symbol(J) \== 'LIT' then call test_failed '2'
if symbol('a.j') \== 'LIT' then call test_failed '3'
if symbol(2) \== 'LIT' then call test_failed '4'
if symbol('*') \== 'BAD' then call test_failed '5'
/* These from Mark Hessling. */
parse value 'foobar' with alpha 1 beta 1 omega 1 gamma.foobar
omega = 'FOOBAR'
if symbol('HEPP') \== 'LIT' then call test_failed '6'
if symbol('ALPHA') \== 'VAR' then call test_failed '7'
if symbol('Un*x') \== 'BAD' then call test_failed '8'
if symbol('gamma.delta') \== 'LIT' then call test_failed '9'
if symbol('gamma.FOOBAR') \== 'VAR' then call test_failed '10'
if symbol('gamma.alpha') \== 'LIT' then call test_failed '11'
if symbol('gamma.omega') \== 'VAR' then call test_failed '12'
/* if symbol('gamma.Un*x') \== 'LIT' then call test_failed '13 ' also fails in REXX370 */
if symbol('Un*x.gamma') \== 'BAD' then call test_failed '14'
if symbol('!!') \== 'LIT' then call test_failed '15'
if symbol('') \== 'BAD' then call test_failed '16'
if symbol('00'x) \== 'BAD' then call test_failed '17'
if symbol('foo-bar') \== 'BAD' then call test_failed '18'
say '... SYMBOL done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
