/* Test the EXECCOMM interface */
say 'Look for TESTEXC OK'

address COMMAND
say 'Testing EXECCOMM'
'GLOBAL MACLIB CMSHRC CMSLIB'
'ASSEMBLE TESTEXC'
'LOAD TESTEXC'
'GENMOD TESTEXC'
say '*****************************'
say 'Assign value to REXX variable'
'TESTEXC SET TESTVAR Use this string for test data'
Say 'TESTEXC RC='rc
say 'Rexx variable contents after set are:' testvar
if testvar \== 'Use this string for test data' then say 'failed in test 1'

say '*****************************'
say 'Retrieve variable value from REXX'
setvar = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
say 'Variable value to retrieve is:' setvar
'TESTEXC FETCH SETVAR'
Say 'TESTEXC RC='rc
say 'Was that correct?'

'ERASE TESTEXC TEXT A'
'ERASE TESTEXC MODULE A'
say 'TESTEXC OK'
