/* TRACE */
parse source system .
if system = 'CMS' then suffix = ''
else suffix = '.exec'

say 'Testing TRACE ...'
fail_count=0

/* These from TRL2. */
value = trace()
if value \== 'N' then call test_failed '1: trace()=' value
value = trace('O')
if value \== 'N' then call test_failed '2: trace()=' value
value = trace('A')
if value \== 'O' then call test_failed '3: trace()=' value
value = trace('F')
if value \== 'A' then call test_failed '4: trace()=' value
value = trace()
if value \== 'F' then call test_failed '5: trace()=' value

trace O

trace N
value = trace()
if value \== 'N' then call test_failed '6: trace()=' value
say 'test 6 expecting a trace ...'
'exitneg_' || suffix
if RC >=0 then call test_failed '6'
else say '... was there one?'

trace N
value = trace()
if value \== 'N' then call test_failed '7: trace()=' value
say 'test 7 expecting no trace ...'
'exitok_' || suffix
if RC <>0 then call test_failed '7'
else say '... was there one?'

trace N
value = trace()
if value \== 'N' then call test_failed '8: trace()=' value
say 'test 8 expecting no trace ...'
'exitpos_' || suffix
if RC <=0 then call test_failed '8'
else say '... was there one?'

trace F
if trace() \== 'F' then call test_failed '9'
say 'test 9 expecting a trace ...'
'exitneg_' || suffix
if RC >=0 then call test_failed '9'
else say '... was there one?'

trace F
value = trace()
if value \== 'F' then call test_failed '10: trace()=' value
say 'test 10 expecting no trace ...'
'exitok_' || suffix
if RC <>0 then call test_failed '10'
else say '... was there one?'

trace F
if trace() \== 'F' then call test_failed '11'
say 'test 11 expecting no trace ...'
'exitpos_' || suffix
if RC <=0 then call test_failed '11'
else say '... was there one?'

trace E
if trace() \== 'E' then call test_failed '12'
say 'test 12 expecting a trace ...'
'exitneg_' || suffix
if RC >=0 then call test_failed '12'
else say '... was there one?'

trace E
value = trace()
if value \== 'E' then call test_failed '13: trace()=' value
say 'test 13 expecting no trace ...'
'exitok_' || suffix
if RC <>0 then call test_failed '13'
else say '... was there one?'

trace E
if trace() \== 'E' then call test_failed '14'
say 'test 14 expecting a trace ...'
'exitpos_' || suffix
if RC <=0 then call test_failed '14'
else say '... was there one?'

say '... TRACE done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
