/* X2D */
say 'Testing X2D ...'
fail_count=0
parse source system .
select
    when system = 'CMS' then charset = 'E'
    when system = 'UNIX' then charset = 'A'
    when system = 'WIN64' then charset = 'A'
    otherwise say 'test 5 undefined'
end
/* These from TRL2. */
if x2d('0E') \== 14 then call test_failed '1'
if x2d('81') \== 129 then call test_failed '2'
if x2d('F81') \== 3969 then call test_failed '3'
if x2d('FF81') \== 65409 then call test_failed '4'
if charset = 'E' then if x2d('c6 f0'x) \== 240 then call test_failed '5'
if x2d('F0') \== 240 then call test_failed '6'
if x2d('81',2) \== -127 then call test_failed '7'
if x2d('81',4) \== 129 then call test_failed '8'
if x2d('F081',4) \== -3967 then call test_failed '9'
if x2d('F081',3) \== 129 then call test_failed '10'
if x2d('F081',2) \== -127 then call test_failed '11'
if x2d('F081',1) \== 1 then call test_failed '12'
if x2d('0031',0) \== 0 then call test_failed '13'
/* These from Mark Hessling. */
if x2d( 'ff80', 2) \== '-128' then call test_failed '14'
if x2d( 'ff80', 1) \== '0' then call test_failed '15'
if x2d( 'ff 80', 1) \== '0' then call test_failed '16'
if x2d( '' ) \== '0' then call test_failed '17'
if x2d( '101' ) \== '257' then call test_failed '18'
if x2d( 'ff' ) \== '255' then call test_failed '19'
if x2d( 'ffff') \== '65535' then call test_failed '20'
if x2d( 'ffff', 2) \== '-1' then call test_failed '21'
if x2d( 'ffff', 1) \== '-1' then call test_failed '22'
if x2d( 'fffe', 2) \== '-2' then call test_failed '23'
if x2d( 'fffe', 1) \== '-2' then call test_failed '24'
if x2d( 'ffff', 4) \== '-1' then call test_failed '25'
if x2d( 'ffff', 2) \== '-1' then call test_failed '26'
if x2d( 'fffe', 4) \== '-2' then call test_failed '27'
if x2d( 'fffe', 2) \== '-2' then call test_failed '28'
if x2d( 'ffff', 3) \== '-1' then call test_failed '29'
if x2d( '0fff') \== '4095' then call test_failed '30'
if x2d( '0fff', 4) \== '4095' then call test_failed '31'
if x2d( '0fff', 3) \== '-1' then call test_failed '32'
if x2d( '07ff') \== '2047' then call test_failed '33'
if x2d( '07ff', 4) \== '2047' then call test_failed '34'
if x2d( '07ff', 3) \== '2047' then call test_failed '35'
if x2d( 'ff7f', 1) \== '-1' then call test_failed '36'
if x2d( 'ff7f', 2) \== '127' then call test_failed '37'
if x2d( 'ff7f', 3) \== '-129' then call test_failed '38'
if x2d( 'ff7f', 4) \== '-129' then call test_failed '39'
if x2d( 'ff7f', 5) \== '65407' then call test_failed '40'
if x2d( 'ff80', 1) \== '0' then call test_failed '41'
if x2d( 'ff80', 2) \== '-128' then call test_failed '42'
if x2d( 'ff80', 3) \== '-128' then call test_failed '43'
if x2d( 'ff80', 4) \== '-128' then call test_failed '44'
if x2d( 'ff80', 5) \== '65408' then call test_failed '45'
if x2d( 'ff81', 1) \== '1' then call test_failed '46'
if x2d( 'ff81', 2) \== '-127' then call test_failed '47'
if x2d( 'ff81', 3) \== '-127' then call test_failed '48'
if x2d( 'ff81', 4) \== '-127' then call test_failed '49'
if x2d( 'ff81', 5) \== '65409' then call test_failed '50'
if x2d( 'ffffffffffff', 12) \== '-1' then call test_failed '51'
/* These from SCXBIFA4 */
if X2D((00000000000000001+1-0.000000)) \== '2' then call test_failed '52'
if X2D((1&1|0=22*33)) \== '1' then call test_failed '53'
if X2D((99/3+10*126-(33||2)//5-1099)) \== '402' then call test_failed '54'
if X2D(ABS((99/3+10*126-(33||2)//5-1099))) \== '402' then call test_failed '55'
if X2D(ABS((1&1|0=22*33))) \== '1' then call test_failed '56'
if X2D(ABS((00000000000000001+1-0.000000))) \== '2' then call test_failed '57'
if X2D(ABS(COPIES(0,249)||1)) \== '1' then call test_failed '58'
if X2D(ABS(RIGHT(LEFT(REVERSE(321),2),REVERSE(LEFT(123,ABS(-1)))))) \== '2' then call test_failed '59'
if X2D(COPIES(0,249)||1) \== '1' then call test_failed '60'
if X2D(RIGHT(LEFT(REVERSE(321),2),REVERSE(LEFT(123,ABS(-1))))) \== '2' then call test_failed '61'
/* These from SCBx2d1 */
if X2D('') \== '0' then call test_failed '62'
if x2d(''X) \== '0' then call test_failed '63'
if X2D('a') \== '10' then call test_failed '64'
if X2D('0f') \== '15' then call test_failed '65'
if x2D('80') \== '128' then call test_failed '66'
if x2d('765') \== '1893' then call test_failed '67'
/* BREXX Does not support large # digits */
if is_brexx=0 then do
    Numeric Digits 1000
    if x2D('eeeeeeeeeeeeeeeeeeeeeeeee') \==,
        '1183140560213014108063589658350' then call test_failed '68'
Numeric Digits
end
if x2d(01234) \== '4660' then call test_failed '69'
if x2d(1E2) \== '482' then call test_failed '70'
if x2d(+1E+2) \== '256' then call test_failed '71'
if x2d(+.1E2) \== '16' then call test_failed '72'
Signal Off Novalue
if x2d(baba) \== '47802' then call test_failed '73'
if X2D(1 + 1E+2 ) \== '257' then call test_failed '74'
if X2D('',0) \== '0' then call test_failed '75'
if X2D('',12) \== '0' then call test_failed '76'
if X2D('abc',0) \== '0' then call test_failed '77'
if X2D('abc',1) \== '-4' then call test_failed '78'
if X2D('abc',3) \== '-1348' then call test_failed '79'
if X2D('abc',5) \== '2748' then call test_failed '80'
if X2D('abc',12345) \== '2748' then call test_failed '81'
if x2d(1+3,1+3) \== '4' then call test_failed '82'
if x2D(256+12,10+2) \== '616' then call test_failed '83'
if x2d('12',987654321) \== '18' then call test_failed '84'
if d2x(X2D('12345')) \== '12345' then call test_failed '85'
say '... X2D done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
