/* XRANGE */
say 'Testing XRANGE ...'
fail_count=0
parse source system .
select
    when system='CMS' then charset='E'
    when system='UNIX' then charset='A'
    when system='WIN64' then charset='A'
    otherwise say 'charset undefined'
end
/* These from TRL2. */
if xrange('a','f')\=='abcdef' then call test_failed '1'
if xrange('03'x,'07'x)\=='0304050607'x then call test_failed '2'
/* if xrange('04'x)\=='0001020304'x then call test_failed '3' */
if xrange('FE'x,'02'x)\=='FEFF000102'x then call test_failed '4'
/* These from Mark Hessling. */
if charset='A' & xrange('f','r')\=='fghijklmnopqr' then call test_failed '5'
if charset='E' & xrange('f','r')\=='fghi' || '8a8b8c8d8e8f90'x || 'jklmnopqr' then call test_failed '5'
if xrange('7d'x,'83'x)\=='7d7e7f80818283'x then call test_failed '6'
if xrange('a','a')\=='a' then call test_failed '7'
say '... XRANGE done'
exit fail_count
test_failed:
say 'failed in test' arg(1)
fail_count=fail_count+1
return
